Tekla Open API Reference for Tekla Structures 2025
TeklaStructuresSettings.ToolOptionNames.DirectManipulation Field
 The direct manipulation.
 Namespace: Tekla.Structures
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public const string DirectManipulation = "DirectModificationButton"
Public Const DirectManipulation As String = "DirectModificationButton"
Field Value
Type: String
See Also
Reference
TeklaStructuresSettings.ToolOptionNames Class
Tekla.Structures Namespace